## Plan Result (543: stg_frontdoor - TerraformPlanApply)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 7 to add, 4 to change, 3 to destroy.</code></pre>

* Create
  * module.premium_front_door.azurerm_cdn_frontdoor_custom_domain_association.custom_association_A[&#34;hmcts-courtfines-staging&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_custom_domain_association.custom_association_B[&#34;hmcts-courtfines-staging&#34;]
  * module.premium_front_door.azurerm_dns_txt_record.public_dns_record[&#34;hmcts-courtfines-staging&#34;]
  * module.premium_front_door.azurerm_key_vault_access_policy.frontdoor_premium_kv_access[0]
* Update
  * module.premium_front_door.azapi_update_resource.frontdoor_system_identity
  * module.premium_front_door.azurerm_cdn_frontdoor_origin.front_door_origin[&#34;staging-immigrationappealsonline&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_A[&#34;hmcts-courtfines-staging&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_B[&#34;hmcts-courtfines-staging&#34;]
* Replace
  * module.premium_front_door.azurerm_cdn_frontdoor_custom_domain.custom_domain[&#34;hmcts-courtfines-staging&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_security_policy.security_policy[&#34;hmcts-courtfines-staging&#34;]
  * module.premium_front_door.azurerm_role_assignment.frontdoor_premium_kv_access[0]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.premium_front_door.azapi_update_resource.frontdoor_system_identity will be updated in-place
  ~ resource "azapi_update_resource" "frontdoor_system_identity" {
      ~ body                    = jsonencode(
          ~ {
              ~ identity = {
                  ~ type = "None" -> "SystemAssigned"
                }
            }
        )
        id                      = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/lz-stg-rg/providers/Microsoft.Cdn/profiles/sdshmcts-stg"
        name                    = "sdshmcts-stg"
      ~ output                  = jsonencode({}) -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_custom_domain.custom_domain["hmcts-courtfines-staging"] must be replaced
-/+ resource "azurerm_cdn_frontdoor_custom_domain" "custom_domain" {
      ~ expiration_date          = "2025-07-03T14:57:58.9612011+00:00" -> (known after apply)
      ~ host_name                = "courtfines-app-staging.staging.platform.hmcts.net" -> "courtfines-app.staging.platform.hmcts.net" # forces replacement
      ~ id                       = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/lz-stg-rg/providers/Microsoft.Cdn/profiles/sdshmcts-stg/customDomains/hmcts-courtfines-staging" -> (known after apply)
        name                     = "hmcts-courtfines-staging"
      ~ validation_token         = "_vuqj7wap1d4nt4b9uzpe5t7mv22i0ng" -> (known after apply)
        # (2 unchanged attributes hidden)

      ~ tls {
          ~ cdn_frontdoor_secret_id = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/lz-stg-rg/providers/Microsoft.Cdn/profiles/sdshmcts-stg/secrets/0--024de359-c4f7-4e57-a825-b2ca1c4fcc96-courtfines-app-staging-staging-platform-hmcts-net" -> (known after apply)
            # (2 unchanged attributes hidden)
        }
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_custom_domain_association.custom_association_A["hmcts-courtfines-staging"] will be created
  + resource "azurerm_cdn_frontdoor_custom_domain_association" "custom_association_A" {
      + cdn_frontdoor_custom_domain_id = (known after apply)
      + cdn_frontdoor_route_ids        = [
          + "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/lz-stg-rg/providers/Microsoft.Cdn/profiles/sdshmcts-stg/afdEndpoints/sdshmcts-stg/routes/hmcts-courtfines-staging",
        ]
      + id                             = (known after apply)
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_custom_domain_association.custom_association_B["hmcts-courtfines-staging"] will be created
  + resource "azurerm_cdn_frontdoor_custom_domain_association" "custom_association_B" {
      + cdn_frontdoor_custom_domain_id = (known after apply)
      + cdn_frontdoor_route_ids        = [
          + "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/lz-stg-rg/providers/Microsoft.Cdn/profiles/sdshmcts-stg/afdEndpoints/sdshmcts-stg/routes/hmcts-courtfines-stagingHttpsRedirect",
        ]
      + id                             = (known after apply)
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_origin.front_door_origin["staging-immigrationappealsonline"] will be updated in-place
  ~ resource "azurerm_cdn_frontdoor_origin" "front_door_origin" {
      ~ host_name                      = "dualstack.iacfees-s-elbhmcts-dgd2ej56uxef-715536071.eu-west-1.elb.amazonaws.com" -> "dualstack.iacfees-s-ELBhmcts-DGD2EJ56UXEF-715536071.eu-west-1.elb.amazonaws.com"
        id                             = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/lz-stg-rg/providers/Microsoft.Cdn/profiles/sdshmcts-stg/originGroups/staging-immigrationappealsonline/origins/staging-immigrationappealsonline"
        name                           = "staging-immigrationappealsonline"
        # (8 unchanged attributes hidden)
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_A["hmcts-courtfines-staging"] will be updated in-place
  ~ resource "azurerm_cdn_frontdoor_route" "routing_rule_A" {
      ~ cdn_frontdoor_custom_domain_ids = [] -> (known after apply)
        id                              = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/lz-stg-rg/providers/Microsoft.Cdn/profiles/sdshmcts-stg/afdEndpoints/sdshmcts-stg/routes/hmcts-courtfines-staging"
      ~ link_to_default_domain          = true -> false
        name                            = "hmcts-courtfines-staging"
        # (10 unchanged attributes hidden)
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_B["hmcts-courtfines-staging"] will be updated in-place
  ~ resource "azurerm_cdn_frontdoor_route" "routing_rule_B" {
      ~ cdn_frontdoor_custom_domain_ids = [] -> (known after apply)
        id                              = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/lz-stg-rg/providers/Microsoft.Cdn/profiles/sdshmcts-stg/afdEndpoints/sdshmcts-stg/routes/hmcts-courtfines-stagingHttpsRedirect"
      ~ link_to_default_domain          = true -> false
        name                            = "hmcts-courtfines-stagingHttpsRedirect"
        # (10 unchanged attributes hidden)
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_security_policy.security_policy["hmcts-courtfines-staging"] must be replaced
-/+ resource "azurerm_cdn_frontdoor_security_policy" "security_policy" {
      ~ id                       = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/lz-stg-rg/providers/Microsoft.Cdn/profiles/sdshmcts-stg/securityPolicies/hmctscourtfinesstagingstgPremium-securityPolicy" -> (known after apply)
        name                     = "hmctscourtfinesstagingstgPremium-securityPolicy"
        # (1 unchanged attribute hidden)

      ~ security_policies {
          ~ firewall {
                # (1 unchanged attribute hidden)

              ~ association {
                    # (1 unchanged attribute hidden)

                  ~ domain {
                      ~ active                  = true -> (known after apply)
                      ~ cdn_frontdoor_domain_id = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/lz-stg-rg/providers/Microsoft.Cdn/profiles/sdshmcts-stg/customDomains/hmcts-courtfines-staging" -> (known after apply) # forces replacement
                    }
                }
            }
        }
    }

  # module.premium_front_door.azurerm_dns_txt_record.public_dns_record["hmcts-courtfines-staging"] will be created
  + resource "azurerm_dns_txt_record" "public_dns_record" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "_dnsauth.courtfines-app"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "staging.platform.hmcts.net"

      + record {
          + value = (known after apply)
        }
    }

  # module.premium_front_door.azurerm_key_vault_access_policy.frontdoor_premium_kv_access[0] will be created
  + resource "azurerm_key_vault_access_policy" "frontdoor_premium_kv_access" {
      + certificate_permissions = [
          + "Get",
          + "List",
        ]
      + id                      = (known after apply)
      + key_permissions         = [
          + "Get",
          + "List",
        ]
      + key_vault_id            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/sds-platform-stg-rg/providers/Microsoft.KeyVault/vaults/acmedtssdsstg"
      + object_id               = (known after apply)
      + secret_permissions      = [
          + "Get",
          + "List",
        ]
      + tenant_id               = (known after apply)
    }

  # module.premium_front_door.azurerm_role_assignment.frontdoor_premium_kv_access[0] must be replaced
-/+ resource "azurerm_role_assignment" "frontdoor_premium_kv_access" {
      + condition_version                      = (known after apply)
      ~ id                                     = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/sds-platform-stg-rg/providers/Microsoft.KeyVault/vaults/acmedtssdsstg/providers/Microsoft.Authorization/roleAssignments/c6d45557-9b34-4e0e-dd7d-23e168b7bb2e" -> (known after apply)
      ~ name                                   = "c6d45557-9b34-4e0e-dd7d-23e168b7bb2e" -> (known after apply)
      ~ principal_id                           = "2a8f7286-9685-4817-8950-809b71c01ca1" -> (known after apply) # forces replacement
      ~ principal_type                         = "ServicePrincipal" -> (known after apply)
      ~ role_definition_id                     = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/providers/Microsoft.Authorization/roleDefinitions/4633458b-17de-408a-b874-0445c86b69e6" -> (known after apply)
      + skip_service_principal_aad_check       = (known after apply)
        # (5 unchanged attributes hidden)
    }

Plan: 7 to add, 4 to change, 3 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":953,"Program":"tfcmt","SHA1":"","Target":"543: stg_frontdoor - TerraformPlanApply","Vars":{}} -->